{
  "schema": "real-dataset-metadata/v1.0.0.json",
  "label": "ds003844",
  "version": "1.0.3",
  "title": "Clinical Epilepsy iEEG to BIDS — RESPect Intraoperative iEEG",
  "summary": "<p>The <strong>Clinical Epilepsy iEEG to BIDS — RESPect_intraoperative_iEEG</strong> dataset (OpenNeuro <code>ds003844</code>) contains <strong>intraoperative intracranial electroencephalography (iEEG)</strong> recordings from patients with drug-resistant focal epilepsy who underwent resective epilepsy surgery at the <strong>University Medical Center Utrecht (UMCU)</strong>, the Netherlands. The data form the intraoperative component of the RESPect (Registry for Epilepsy Surgery Patients) programme and were curated according to the <strong>iEEG-BIDS</strong> extension of the Brain Imaging Data Structure (BIDS).</p>\n<p>The dataset includes <strong>acute intraoperative electrocorticography (ECoG)</strong> recordings acquired during epilepsy surgery, typically in lesional epilepsy cases, to delineate the epileptogenic cortex and guide the extent of resection. Recordings cover multiple surgical <em>“situations”</em> (for example pre-resection, intermediate and post-resection phases) and may include conditions such as resting-state anaesthesia, somatosensory evoked potentials, and functional stimulation. Accompanying tabular files (for example <code>participants.tsv</code> and electrodes-related TSV files) provide essential patient and recording-level information.</p>\n<p>The data were collected as part of routine clinical care and subsequently <strong>pseudo-anonymised</strong>, <strong>organised</strong>, and <strong>validated</strong> within an explicit workflow for converting clinical iEEG into BIDS, as described by Demuru et al. (Neuroinformatics 2022). The resulting dataset is intended to support research on epilepsy surgery, intraoperative electrophysiology, and methods for iEEG analysis and data standardisation.</p>",
  "purpose": "<p>This dataset was created to <strong>demonstrate and enable a practical workflow for converting full clinical intraoperative iEEG epilepsy data into the iEEG-BIDS standard</strong> and to make a representative sample of such data openly available for research.</p>\n<h2>Main objectives</h2>\n<ul>\n  <li>Provide a <strong>worked example</strong> of clinical intraoperative ECoG data fully structured in <strong>iEEG-BIDS</strong>, including folder layout, file naming, and required metadata.\n  </li>\n  <li>Facilitate <strong>methodological research</strong> on iEEG processing, electrode localisation, and data management workflows by supplying real, heterogeneous clinical data that have been systematically organised.\n  </li>\n  <li>Support <strong>epilepsy surgery research</strong>, including studies of interictal epileptiform activity, mapping of epileptogenic cortex, and relationships between intraoperative electrophysiology and post-surgical seizure outcome.\n  </li>\n  <li>Advance the <strong>FAIR data principles</strong> (Findable, Accessible, Interoperable, Reusable) for clinical electrophysiology by sharing a curated, open dataset from a tertiary epilepsy surgery centre.\n  </li>\n</ul>\n<p>Although the dataset is primarily intended as a <strong>reference implementation</strong> of iEEG-BIDS for clinical intraoperative data, it is also suitable for methodological and exploratory analyses (for example, spectral characteristics of intraoperative activity, detection of interictal discharges, or evaluation of pre-processing pipelines).</p>",
  "baseline": "<p>The baseline for this dataset is defined relative to the <strong>epilepsy surgery procedure</strong> during which intraoperative ECoG recordings were acquired.</p>\n<ul>\n  <li><strong>Clinical baseline event:</strong> resective epilepsy surgery performed for drug-resistant focal epilepsy.</li>\n  <li><strong>Recording baseline:</strong> intraoperative ECoG situations (for example pre-resection, intermediate and post-resection), each represented as a BIDS <code>session</code> (for example <code>ses-SITUATION1A</code>) that captures a distinct phase of the operation with a specific electrode configuration.</li>\n</ul>\n<p>All ECoG recordings are <strong>peri-operative</strong> and anchored to the timeline of the surgical procedure rather than to long-term follow-up or longitudinal clinic visits.</p>",
  "inclusionCriteria": "<p>Inclusion criteria for the dataset are derived from the RESPect epilepsy surgery registry and the description by Demuru et al. (2022):</p>\n<ul>\n  <li><strong>Epilepsy surgery:</strong> patients underwent <strong>resective epilepsy surgery</strong> at the University Medical Center Utrecht (UMCU), the Netherlands.\n  </li>\n  <li><strong>Drug-resistant focal epilepsy:</strong> patients had <strong>drug-resistant epilepsy</strong> and were selected for surgery following multidisciplinary presurgical evaluation in a tertiary referral centre.\n  </li>\n  <li><strong>Intracranial monitoring with intraoperative ECoG:</strong> patients underwent <strong>intraoperative electrocorticography (ECoG)</strong> as part of the surgical treatment. The dataset focuses on cases where intraoperative ECoG recordings were used to help delineate the epileptogenic zone and guide the extent of resection.\n  </li>\n  <li><strong>Post-surgical outcome:</strong> for the broader set of subjects described by Demuru et al., all patients became <strong>seizure-free after surgery</strong>, ensuring that the intraoperative recordings correspond to successful resections.\n  </li>\n  <li><strong>Availability and suitability of data:</strong> clinical source data and metadata were sufficiently complete to allow conversion to the iEEG-BIDS specification (for example, availability of recording logs, electrode information, and essential clinical context).</li>\n  <li><strong>Ethical approval and consent:</strong> inclusion in the RESPect registry under ethics committee approval (18-109), with a waiver of consent for the 2008‑2017 period and explicit consent with data-sharing permission for patients operated on from 2018 onwards, as applicable.</li>\n</ul>",
  "exclusionCriteria": "<p>Subjects were <strong>not</strong> included in this intraoperative dataset if any of the following applied:</p>\n<ul>\n  <li><strong>No resective surgery:</strong> epilepsy surgery was not performed or did not involve a resection (for example, diagnostic procedures without subsequent resection).</li>\n  <li><strong>No intraoperative ECoG:</strong> patients who did not undergo intraoperative electrocorticography, or whose intraoperative data were not suitable for conversion to BIDS (for example, incomplete, corrupted, or unavailable recordings) were excluded from this dataset.</li>\n  <li><strong>Consent constraints (from 2018 onwards):</strong> patients who <strong>withdrew consent</strong> or did not grant permission to share data with other researchers and/or commercial parties were not included in the openly shared dataset.</li>\n  <li><strong>Data protection or quality issues:</strong> recordings that could not be adequately pseudo-anonymised or that lacked essential metadata required for iEEG-BIDS compliance were excluded from open sharing.</li>\n  <li><strong>Long-term recordings only:</strong> patients whose shared data relate exclusively to long-term ECoG or stereo-EEG (SEEG) recordings are included in a <strong>separate</strong> OpenNeuro dataset (<code>ds003848</code>) rather than in this intraoperative dataset.</li>\n</ul>",
  "targets": "<p>The primary focus of this dataset is to provide <strong>raw intraoperative iEEG recordings</strong> and associated metadata structured in iEEG-BIDS. The dataset itself does <strong>not define a single prespecified predictive target</strong> (for example, a specific outcome label for each segment of recording) but can support multiple downstream targets depending on the research question.</p>\n<h2>Potential targets supported by the dataset</h2>\n<ul>\n  <li><strong>Electrophysiological targets:</strong> detection and characterisation of <strong>interictal epileptiform discharges</strong>, high-frequency oscillations, or other intraoperative ECoG markers of epileptogenic tissue.</li>\n  <li><strong>Spatial targets:</strong> classification of electrodes as <em>resected</em>, <em>edge</em>, or <em>non-resected</em> based on their location relative to the resection margin (information provided in the accompanying metadata in the larger RESPect framework).</li>\n  <li><strong>Clinical/surgical targets:</strong> although detailed clinical variables are primarily stored in the local registry, the dataset can be linked (in principle) to epilepsy type, pathology and post-surgical seizure outcome (all patients described in the associated publication became seizure-free after surgery).</li>\n</ul>\n<p>Researchers using the dataset are expected to define and derive their own <strong>task-specific targets</strong> (for example, seizure-onset vs non-seizure segments, pathological vs non-pathological patterns) from the raw signals and annotations, and, where permitted, by linkage to clinical registry data at the originating institution.</p>",
  "studyDesign": "<p>The dataset corresponds to a <strong>retrospective observational case series</strong> derived from the RESPect registry of epilepsy surgery patients at a tertiary referral centre.</p>\n<ul>\n  <li><strong>Design:</strong> retrospective observational study using data from routine clinical care, followed by systematic standardisation and curation into iEEG-BIDS.</li>\n  <li><strong>Population:</strong> a subset of patients with drug-resistant focal epilepsy who underwent <strong>resective epilepsy surgery</strong> and intraoperative ECoG monitoring.</li>\n  <li><strong>Data source:</strong> clinical iEEG recordings and associated information collected in the operating theatre and electronic data capture systems (for example, Castor EDC), not acquired for research-only purposes.</li>\n  <li><strong>Sampling frame:</strong> patients operated at UMC Utrecht from 2008 onwards, with this particular OpenNeuro dataset containing the <strong>intraoperative ECoG subset</strong> of the 12-patient cohort described by Demuru et al. (6 intraoperative cases, the remaining 6 long-term ECoG/SEEG cases provided in a separate dataset).</li>\n  <li><strong>Interventional context:</strong> the underlying clinical context is interventional (epilepsy surgery), but the dataset itself captures <strong>observational recordings</strong> obtained during standard clinical procedures (for example, mapping and resection guidance) rather than experimental interventions.</li>\n</ul>",
  "temporalCoverage": {
    "startDate": "2008-01-01",
    "endDate": null
  },
  "geographicCoverage": {
    "geographicInfo": "All subjects were treated at the University Medical Center Utrecht (UMCU), a tertiary referral centre for epilepsy surgery in the Netherlands, as part of the RESPect epilepsy surgery registry.",
    "geographicUnits": [
      {
        "countryCode": "NL",
        "countrySubdivisionCodes": []
      }
    ]
  },
  "dataSampling": "<p>The dataset represents a <strong>targeted clinical sample</strong> rather than a statistically designed sample of all epilepsy surgery patients.</p>\n<ul>\n  <li><strong>Target population:</strong> patients with drug-resistant focal epilepsy undergoing <strong>resective epilepsy surgery</strong> at the University Medical Center Utrecht.</li>\n  <li><strong>Sampling process:</strong> patients who underwent epilepsy surgery from 2008 onwards were prospectively or retrospectively enrolled in the RESPect registry. From this registry, a <strong>subset of patients with intraoperative ECoG recordings</strong> was selected for conversion to iEEG-BIDS and inclusion in this OpenNeuro dataset.</li>\n  <li><strong>Sample size:</strong> the overall cohort in the associated publication comprises 12 subjects (6 intraoperative ECoG, 3 long-term ECoG, 3 SEEG). This particular dataset (<code>ds003844</code>) contains the <strong>intraoperative ECoG subset</strong>, corresponding to six patients, as described in the Information Sharing Statement of Demuru et al. (2022).\n  </li>\n  <li><strong>Selection characteristics:</strong> inclusion required both (1) suitable intraoperative recordings and (2) feasibility of pseudo-anonymisation and BIDS conversion. Patients whose data could not be structured or shared in this way were not included.</li>\n  <li><strong>Representativeness:</strong> the dataset is <strong>not intended as a population-representative sample</strong>. Instead, it provides a small, well-documented, single-centre example of intraoperative iEEG data, suitable for methodological studies and proof-of-concept analyses.</li>\n</ul>",
  "acquisitionMethods": "<h2>Intraoperative electrocorticography (ECoG) recordings</h2>\n<p>All recordings are <strong>intraoperative intracranial EEG (iEEG)</strong> acquired during resective epilepsy surgery at UMC Utrecht, as described in detail by Demuru et al. (Neuroinformatics 2022 and related preprint).</p>\n<ul>\n  <li><strong>Recording context:</strong> intraoperative ECoG was performed in lesional epilepsy cases with concordant non-invasive investigations, to determine the extent of neocortical resection and assess involvement of mesiotemporal structures. Recordings were obtained during different surgical <em>situations</em> (for example pre-resection, intermediate, post-resection) and may include resting-state anaesthesia, somatosensory evoked potentials, or functional stimulation conditions.</li>\n  <li><strong>Electrode technology:</strong> subdural grid and strip electrodes and, where appropriate, depth electrodes, supplied by established manufacturers (for example AdTech, PMT, Dixi) as reported in Demuru et al. Electrodes were positioned on the exposed cortical surface or inserted stereotactically, according to clinical requirements.</li>\n  <li><strong>Recording systems:</strong> clinical recordings were obtained with <strong>Micromed</strong> headboxes (for example LTM64/128 Express, SD-128, Flexi; MicroMed, Mogliano Veneto, Italy) and the associated clinical EEG system used at UMC Utrecht.</li>\n  <li><strong>Sampling frequency:</strong> the majority of intraoperative recordings were sampled at <strong>512 Hz or 2048 Hz</strong>; some recordings used other clinically standard sampling rates (for example 256 or 1024 Hz), as appropriate to the device and protocol.</li>\n  <li><strong>Referencing and montage:</strong> signals were recorded using clinically standard montages for intraoperative ECoG. The precise montage and referencing scheme for each recording are documented in the BIDS sidecar files (for example <code>*_ieeg.json</code> and <code>electrodes.tsv</code>), including channel names and properties.</li>\n  <li><strong>Clinical environment:</strong> recordings were obtained in the operating theatre under anaesthesia or sedation as part of routine surgical care. No additional experimental stimuli beyond standard clinical protocols (for example intraoperative stimulation or somatosensory evoked potential protocols) were introduced specifically for research purposes.</li>\n</ul>\n<h2>BIDS/iEEG-BIDS conversion</h2>\n<ul>\n  <li><strong>Data structuring:</strong> raw clinical binary files were converted to an <strong>iEEG-BIDS-compliant</strong> directory structure. Each subject is labelled with a <code>RESP</code>-prefixed identifier shared between the clinical registry and BIDS dataset (for example <code>sub-RESPXXXX</code>).</li>\n  <li><strong>Sessions and tasks:</strong> for intraoperative ECoG, each <strong>recording situation</strong> (for example different electrode placements or surgical phases) is encoded as a separate BIDS <strong>session</strong>, and tasks reflect the clinical context (for example <code>task-acute</code> for ongoing anaesthetised recordings, or other labels for SSEP or stimulation protocols).</li>\n  <li><strong>Auxiliary imaging:</strong> where available in the broader workflow, defaced structural MRI scans are processed with tools such as FreeSurfer and stored in derivative directories. For the intraoperative dataset, electrode coordinates may be limited (see Limitations) and are encoded according to iEEG-BIDS requirements.</li>\n</ul>",
  "annotationMethods": "<p>Annotations are primarily relevant for the time series data and follow the principles described by Demuru et al. in their iEEG-BIDS workflow.</p><h2>Time series data</h2><ul><li><p><strong>Clinical annotations:</strong> raw recordings in the clinical EEG system were annotated by <strong>clinical neurophysiologists and trained research staff</strong>. Annotations include events such as segments with prominent epileptiform activity, stimulation epochs, and specific tasks (for example SSEP or other intraoperative protocols).</p></li><li><p><strong>Annotation tools:</strong> annotations were created in the clinical EEG review software and then transferred or mapped into BIDS-compliant event files (for example <code>*_events.tsv</code>) during the conversion workflow.</p></li><li><p><strong>Annotation content:</strong> event files may specify onset times, durations, task labels, and descriptive text fields that characterise intraoperative situations and clinically relevant events. The exact set of annotation codes and their meanings is documented in the associated workflow description and code repositories (for example the GitHub repositories referenced in the Demuru et al. paper).</p></li></ul><p>No distinct image-annotation workflow is associated with this dataset; any structural imaging used for electrode localisation is handled according to standard neuroimaging pipelines (for example FreeSurfer) and documented in derivatives rather than through manual image annotations.</p>",
  "limitations": "<p>This dataset has several important limitations that users should consider when assessing suitability for specific analyses:</p><ul><li><p><strong>Small sample size:</strong> the intraoperative dataset comprises <strong>six patients</strong>, providing rich, detailed data but limited statistical power and generalisability for population-level analyses.</p></li><li><p><strong>Single-centre data:</strong> all data originate from a single tertiary epilepsy surgery centre (UMCU, Netherlands). Surgical approaches, anaesthetic protocols, and electrode configurations may reflect local practice and may differ from other centres.</p></li><li><p><strong>Selected cohort:</strong> the broader cohort described in the associated publication consists of patients who <strong>became seizure-free after surgery</strong>. This introduces outcome-related selection and may not be representative of all epilepsy surgery candidates.</p></li><li><p><strong>Limited clinical metadata in the public release:</strong> detailed clinical variables (for example full seizure history, neuropsychological assessments, pathology, and long-term outcome) are stored in the clinical registry and are not all available in the OpenNeuro dataset. Researchers requiring comprehensive clinical context may need additional collaboration with the originating centre.</p></li><li><p><strong>Electrode coordinate information:</strong> for the intraoperative ECoG examples, BIDS requirements on electrode coordinate fields are satisfied, but in some cases <strong>electrode coordinates are encoded as zeros</strong> due to the absence of accurate stereotactic localisation in the intraoperative setting, as discussed in the technical validation section of Demuru et al. This constrains analyses that depend on precise 3D localisation of intraoperative electrodes.</p></li><li><p><strong>Heterogeneity of recording protocols:</strong> although the data are carefully structured in BIDS, they stem from routine clinical care with <strong>heterogeneous recording durations, sampling frequencies, and stimulation conditions</strong>. Users may need to perform substantial data selection and harmonisation before applying automated analysis pipelines.</p></li></ul>",
  "dataPreprocessing": "<p>The dataset focuses on <strong>minimally processed intraoperative ECoG data</strong> organised according to iEEG-BIDS. The main preprocessing steps relate to data organisation and anonymisation rather than signal transformation.</p>\n<h2>Preprocessing and organisational steps</h2>\n<ul>\n  <li><strong>Pseudo-anonymisation:</strong> removal of direct identifiers from the clinical EEG and imaging files, including replacement of patient identifiers with <code>RESP</code>-based study labels and use of relative or offset times where required for privacy.</li>\n  <li><strong>MRI defacing (where applicable):</strong> structural MRI scans used for electrode localisation were <strong>defaced</strong> before sharing, following standard neuroimaging privacy practices.</li>\n  <li><strong>BIDS conversion:</strong> raw clinical binary files were converted into <strong>BIDS/iEEG-BIDS</strong> folder structures using a six-step workflow that includes assigning subject labels, defining sessions/tasks/runs, annotating binaries, labelling resected/edge/non-resected electrodes, and generating BIDS-compliant metadata files.</li>\n  <li><strong>Validation:</strong> BIDS-formatted datasets were validated with the <strong>BIDS Validator</strong> application to ensure compliance with the iEEG-BIDS specification.</li>\n</ul>\n<h2>Signal processing</h2>\n<p>No universal offline <strong>signal filtering, artefact rejection, or re-referencing</strong> pipeline has been applied as part of the dataset release. The data largely reflect the <strong>clinical acquisition settings</strong>. Users are expected to implement their own pre-processing workflows (for example line-noise filtering, re-referencing, artefact removal, epoching) suited to their analysis objectives.</p>",
  "healthcareSettings": [
    "tertiary care"
  ],
  "patientNum": 6,
  "additionalDocumentation": [
    {
      "url": "https://doi.org/10.1007/s12021-022-09567-6",
      "title": "A Practical Workflow for Organizing Clinical Intraoperative and Long-term iEEG Data in BIDS",
      "description": "Open access journal article by Demuru et al. (Neuroinformatics 2022) describing the workflow and datasets, including the intraoperative ECoG data shared as OpenNeuro ds003844."
    },
    {
      "url": "https://www.medrxiv.org/content/10.1101/2020.12.07.20245290v1",
      "title": "Preprint: Workflow for Organizing Clinical Intraoperative and Long-term iEEG Data in BIDS",
      "description": "Preprint version of the Demuru et al. workflow paper, including detailed methodological description and ethical considerations."
    },
    {
      "url": "https://github.com/UMCU-EpiLAB/umcuEpi_acute_ieeg_respect_bids",
      "title": "GitHub: Intraoperative ECoG BIDS Conversion Code",
      "description": "Code used for converting acute intraoperative ECoG recordings (RESPect_intraoperative_iEEG) to iEEG-BIDS."
    }
  ],
  "dataModalities": [
    "time series",
    "tabular"
  ],
  "dataFormats": [
    {
      "dataModality": "time series",
      "dataFormats": [
        "iEEG-BIDS",
        "TSV"
      ]
    },
    {
      "dataModality": "tabular",
      "dataFormats": [
        "TSV"
      ]
    }
  ],
  "privacyCompliance": "<p>Privacy and data protection were addressed through a combination of <strong>pseudo-anonymisation</strong>, adherence to ethical approvals, and application of neuroimaging privacy practices, as described in the associated publications.</p>\n<h2>Pseudo-anonymisation of iEEG data</h2>\n<ul>\n  <li><strong>Removal of direct identifiers:</strong> clinical identifiers (names, hospital IDs, dates of birth) and other direct identifiers were removed from the shared data. Subjects are represented by <strong>RESP-prefixed codes</strong> that are not directly linkable to patient identity by external users.</li>\n  <li><strong>Temporal information:</strong> recording times and dates were handled in a way consistent with pseudo-anonymisation, for example by using relative timing and avoiding disclosure of exact calendar dates where unnecessary.</li>\n</ul>\n<h2>Imaging data and electrode localisation</h2>\n<ul>\n  <li><strong>MRI defacing:</strong> structural MRI scans used for electrode localisation were <strong>defaced</strong> to remove facial features before any sharing outside the clinical environment.</li>\n  <li><strong>Electrode coordinates:</strong> for the intraoperative dataset, complete stereotactic localisation is not always available; in such cases, electrode coordinates are either absent or represented in a privacy-preserving manner (for example zero coordinates) consistent with iEEG-BIDS requirements and technical validation.</li>\n</ul>\n<h2>Regulatory and ethical framework</h2>\n<ul>\n  <li>The dataset falls under approved protocols from a <strong>medical research ethics committee</strong> (approval number 18-109) and complies with local regulations for the secondary use and sharing of clinical data.</li>\n  <li>For patients operated from 2018 onwards, explicit informed consent procedures include specific questions on data sharing with other researchers and commercial parties; only patients permitting such sharing are included in the open dataset.</li>\n</ul>\n<p>The combination of ethics approval, consent, removal of identifiers, and defacing of anatomical images is designed to <strong>minimise re-identification risk</strong> while preserving the scientific value of the data.</p>",
  "ethicsApproval": [
    {
      "approved": "approved",
      "approvalAuthority": "Medical research ethics committee responsible for the RESPect (Registry for Epilepsy Surgery Patients) protocol, approval number 18-109, at the University Medical Center Utrecht, the Netherlands.",
      "approvalNumber": "18-109",
      "approvalDetails": "<p>Clinical data used in this dataset were collected as part of the <strong>RESPect (Registry for Epilepsy Surgery Patients)</strong> programme at the University Medical Center Utrecht. The registry and associated use of clinical data for research, including conversion of iEEG recordings to BIDS and data sharing, are covered by <strong>ethics approval number 18-109</strong> from the local medical research ethics committee.</p>\n<p>For patients operated between <strong>January 2008 and December 2017</strong>, the ethics committee <strong>waived the need for individual informed consent</strong> for inclusion in the registry. For patients operated from <strong>January 2018 onwards</strong>, explicit informed consent is obtained, including specific questions on whether data may be shared with other researchers and commercial parties. Only patients with appropriate approval or consent are included in the open dataset.</p>",
      "approvalDate": null
    }
  ],
  "patientConsent": "<p>Patient consent procedures are tied to the RESPect registry and vary over calendar time, as described by Demuru et al. and in the registry protocol.</p>\n<ul>\n  <li><strong>2008‑2017 (waiver of consent):</strong> for patients operated between January 2008 and December 2017, the medical research ethics committee <strong>waived the requirement to obtain individual informed consent</strong> for inclusion of clinical data (including iEEG recordings) in the RESPect registry and their use for research.</li>\n  <li><strong>From 2018 onwards (explicit consent):</strong> for patients operated from January 2018 onwards, clinicians obtain <strong>explicit informed consent</strong> for collecting data for research purposes. Patients are informed that identifiable information will be removed, and they are specifically asked whether their data may be <strong>shared with other researchers and with commercial parties</strong>.</li>\n  <li><strong>Open dataset inclusion:</strong> only those patients whose data use is covered by the waiver or who <strong>gave consent for data sharing</strong> are included in the OpenNeuro dataset. Patients who did not agree to external data sharing are not represented in the shared data.</li>\n</ul>\n<p>These procedures ensure that the dataset complies with local data protection regulations and ethics requirements, while enabling responsible reuse for research.</p>",
  "acknowledgements": "<p>The dataset builds on the sustained efforts of the <strong>RESPect group</strong> and many colleagues at the University Medical Center Utrecht and collaborating institutions.</p>\n<p>As acknowledged by Demuru et al., the authors thank the members of the RESPect group for gathering the clinical and electrophysiological data in a complete and consistent manner, with special thanks to <strong>Janine Ophorst</strong> and <strong>Anouk Velders</strong> for their work obtaining informed consent from prospective patients, and to the students and research assistants who contributed to data annotation, including <strong>Jaap van der Aar</strong>, <strong>Giulio Castegnaro</strong>, <strong>Daniel Groothuysen</strong>, <strong>Emile d’Angremont</strong>, <strong>Merel Wassenaar</strong>, <strong>Paul Smits</strong>, <strong>Bram Knipscheer</strong>, and <strong>Sifra Blok</strong>.</p>\n<p>The authors of the associated workflow paper (<strong>Matteo Demuru</strong>, <strong>Dorien van Blooijs</strong>, <strong>Willemiek Zweiphenning</strong>, <strong>Dora Hermes</strong>, <strong>Frans Leijten</strong>, <strong>Maeike Zijlmans</strong>, on behalf of the RESPect group) designed and implemented the pipeline that underpins this dataset and are gratefully acknowledged as the primary scientific contributors.</p>",
  "funding": "<p>The work underlying this dataset and its associated workflow was supported by several funding sources as reported by Demuru et al. (Neuroinformatics 2022):</p>\n<ul>\n  <li>A collaboration project co-funded by the <strong>PPP Allowance</strong> made available by <strong>Health~Holland, Top Sector Life Sciences &amp; Health</strong>, to stimulate public–private partnerships.</li>\n  <li><strong>Alexandre Suerman Stipendium 2015</strong> supporting Willemiek Zweiphenning.</li>\n  <li>Grant <strong>LSHM16054-SGF</strong> supporting Matteo Demuru.</li>\n  <li><strong>ERC Starting Grant 803880</strong> supporting Maeike Zijlmans.</li>\n  <li><strong>NEF 17-07</strong> supporting Dorien van Blooijs.</li>\n  <li><strong>NIH grant R01 MH122258-01</strong> supporting Dora Hermes.</li>\n</ul>\n<p>These funding bodies did not impose restrictions on sharing the anonymised dataset in BIDS format on OpenNeuro.</p>",
  "owners": [
    {
      "name": "University Medical Center Utrecht, Dept. of Neurology & Neurosurgery, Brain Center",
      "contactDetails": {
        "firstName": "Maeike",
        "lastName": "Zijlmans",
        "email": "G.J.M.Zijlmans@umcutrecht.nl"
      }
    },
    {
      "name": "Stichting Epilepsie Instellingen Nederland (SEIN)",
      "contactDetails": null
    }
  ],
  "doi": "10.18112/openneuro.ds003844.v1.0.3",
  "howToCite": {
    "instructions": "<p>Please cite both the dataset and the associated methodology paper when using these data in academic work.</p>",
    "citations": [
      "Demuru M, van Blooijs D, Zweiphenning W, Hermes D, Leijten F, Zijlmans M, on behalf of the RESPect group. Clinical Epilepsy iEEG to BIDS — RESPect_intraoperative_iEEG [dataset]. OpenNeuro. doi:10.18112/openneuro.ds003844.v1.0.3.",
      "Demuru M, van Blooijs D, Zweiphenning W, et al. A practical workflow for organizing clinical intraoperative and long-term iEEG data in BIDS. Neuroinform. 2022;20(3):727–736. doi:10.1007/s12021-022-09567-6."
    ]
  },
  "references": "<p>Demuru M, van Blooijs D, Zweiphenning W, et al. A practical workflow for organizing clinical intraoperative and long-term iEEG data in BIDS. Neuroinform. 2022;20(3):727–736. doi:10.1007/s12021-022-09567-6. Wilkinson MD, Dumontier M, Aalbersberg IJJ, et al. The FAIR Guiding Principles for scientific data management and stewardship. Sci Data. 2016;3:160018. Holdgraf C, Niso G, Armeni K, et al. iEEG-BIDS, extending the Brain Imaging Data Structure specification to human intracranial electrophysiology. Sci Data. 2019;6:102.</p>",
  "modellingTasks": [
    "classification",
    "clustering"
  ],
  "tags": [
    "epilepsy",
    "intracranial-EEG"
  ],
  "licence": {
    "url": "https://creativecommons.org/publicdomain/zero/1.0/",
    "title": "CC0 1.0 Universal Public Domain Dedication",
    "description": "The dataset is distributed under a Creative Commons Zero (CC0 1.0) Public Domain Dedication, consistent with the OpenNeuro repository policy, allowing unrestricted reuse, redistribution, and modification."
  },
  "versionDate": null,
  "versionInfo": null,
  "dataSources": null
}